In [ ]:
import pandas as pd
pd.__version__

In [ ]:
pd.show_versions()

# 2.Make a dataframe

In [ ]:
df = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6], "C": [7, 8, 9]})
df.head()

In [ ]:
import numpy as np
arr = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
pd.DataFrame(arr)

In [ ]:
pd.DataFrame(np.random.rand(4,8))

# How to change column name to ABC

In [ ]:
pd.DataFrame(np.random.rand(4,8), columns=list("ABCDEFGH")) # 4 rows, 8 columns

# 3.How to rename columns

In [ ]:
df = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6]}) # Create a DataFrame
df.rename(columns={'A':'A col','B':'B col'},inplace=True) # rename columns
df

In [ ]:
df.columns = ('col_aa','col_bb') # rename columns
df

In [ ]:
df.columns = df.columns.str.replace('_',' ') # replace '_' with ' ' in column names
df

In [ ]:
df = df.add_prefix('baba_') # add prefix
df

In [ ]:
df.columns = ['col_a', 'col_b'] # rename columns
df

# 4 Using Template Data

In [ ]:
import pandas as pd
import numpy as np
import seaborn as sns

df = sns.load_dataset('tips')
df.head()

In [ ]:
# to see summary 
df.describe()
df.columns

## Saving Dataset

In [ ]:
df.to_excel('tips_data.xlsx')

 # 5 Using Your Own Dataset

In [ ]:
import pandas as pd
df = pd.read_excel('tips_data.xlsx')
df.head()

# 6 Reverse Order

In [ ]:
import pandas as pd
df = pd.read_excel('tips_data.xlsx')
df.loc[::-1].head(-9) # reverse row order and show first 5 rows

> ### **To selects all rows (:) and all columns in reverse order (::-1)**

In [ ]:
df.loc[::-1].reset_index(drop=True).head()

In [ ]:
df.loc[:,::-1]

# 8 Select a Column by Datatype

In [ ]:
df.dtypes # view datatypes of columns

In [ ]:
df.select_dtypes(include=['number']).head() # all numeric columns

In [ ]:
# df.select_dtypes(include=['object']).head() # all object columns
df.select_dtypes(exclude=['object']).head()

# 9 Change Datatype

In [ ]:
df = pd.DataFrame({"A": ['1.12', '2', '3'], "B": ['4', '5', '6']})

df.astype({'A': 'float32', 'B': 'int32'}).dtypes

In [ ]:

pd.to_numeric(df['A'])
# df.dtypes

# 10 Reduce DF Size

In [ ]:
df = sns.load_dataset('titanic')
df.shape
df.sample(frac=0.1).shape

 # 11 Read Data From Clipboard

In [ ]:
import pandas as pd

df = pd.read_clipboard()
df.to_excel('Copied_Data.xlsx')

# 12 Split the DF into 2 DF

In [ ]:
df = sns.load_dataset('titanic')
from random import random
b1= df.sample(frac=0.5,random_state=1) # randomly select 50% of the data
b2 = df.drop(b1.index) # drop the (b1 data) randomly selected rows from the original dataframe

print(b1.shape)
print(b2.shape)
df = b1.append(b2)

# 13 Join 2 Subset

In [ ]:
df = b1.append(b2)

# 14 Filtering a dataset

In [ ]:
df.sex.unique()
df[(df.sex=="male")]

In [ ]:
df.age.unique()
df[(df.age>20 ) & (df.age<24)]

In [ ]:
df[((df.embark_town=="Southampton") | (df.embark_town=="Queenstown")) & (df.sex=="female") & (df.alive=="yes")&(df.alone) ]

In [ ]:
df[(df.embark_town.isin(['Southampton','Queenstown']))].head()

# 15 Filtering by Large Categories

In [ ]:
# df.sex.value_counts()
# df.age.value_counts()
df.embark_town.value_counts()

In [ ]:
df.age.value_counts().nlargest(2)

### To find the index of largest no. of people with gender with their values

In [ ]:
count = df.who.value_counts()
count.nlargest(3)

### To find the index of largest no. of people

In [ ]:
df.embark_town.value_counts().nlargest(3).index

In [ ]:
counts = df.who.value_counts()
df[(df.who.isin(counts.nlargest(1).index))].head()

# 16 Splitt a string into multiple columns

In [ ]:
import pandas as pd 

df = pd.DataFrame({'Name':['Ahmed Abdullah','Faheem Pasha','Muhammad Ahmed','Usman Pasha'],
                   'Location':['Payathayt,Usmania ','Hijaz,Usmania ','Selanic,Usmania ','Istambol,Usmania ']})
df

## Split Name Column into 2 sub-columns

In [ ]:
df[['first_name','last_name']]= df.Name.str.split(" ",expand=True)
df

 ## Expand Location Column into City and Country

In [ ]:
df[['City','Country']]=df.Location.str.split(",",expand=True)
df

## Refine Data Manipulation (Update table)

In [ ]:
df = df[['first_name','last_name','City','Country']]
df

# 17 Aggregate by multiple group / functions

In [1]:
import pandas as pd
import seaborn as sns 

df = sns.load_dataset("titanic")
df.head()
df.groupby("who").count()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,adult_male,deck,embark_town,alive,alone
who,,,,,,,,,,,,,,
child,83,83,83,83,83,83,83,83,83,83,13,83,83,83
man,537,537,537,413,537,537,537,537,537,537,99,537,537,537
woman,271,271,271,218,271,271,271,269,271,271,91,269,271,271

## count the number of rows for each group

In [2]:
df.groupby("who").count()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,adult_male,deck,embark_town,alive,alone
who,,,,,,,,,,,,,,
child,83,83,83,83,83,83,83,83,83,83,13,83,83,83
man,537,537,537,413,537,537,537,537,537,537,99,537,537,537
woman,271,271,271,218,271,271,271,269,271,271,91,269,271,271

## count the types of rows in the who columns

In [3]:
len(df.groupby("who"))

3

In [4]:
df.groupby(["who","pclass","sex"]).count()

                     survived  age  sibsp  parch  fare  embarked  class  \
who   pclass sex
child 1      female         3    3      3      3     3         3      3
             male           3    3      3      3     3         3      3
      2      female        10   10     10     10    10        10     10
             male           9    9      9      9     9         9      9
      3      female        30   30     30     30    30        30     30
             male          28   28     28     28    28        28     28
man   1      male         119   98    119    119   119       119    119
      2      male          99   90     99     99    99        99     99
      3      male         319  225    319    319   319       319    319
woman 1      female        91   82     91     91    91        89     91
      2      female        66   64     66     66    66        66     66
      3      female       114   72    114    114   114       114    114

                     adult_male  deck  embark_town  alive  alone
who   pclass sex
child 1      female           3     3            3      3      3
             male             3     3            3      3      3
      2      female          10     1           10     10     10
             male             9     3            9      9      9
      3      female          30     2           30     30     30
             male            28     1           28     28     28
man   1      male           119    91          119    119    119
      2      male            99     3           99     99     99
      3      male           319     5          319    319    319
woman 1      female          91    78           89     91     91
      2      female          66     9           66     66     66
      3      female         114     4          114    114    114

# 18 Select Specific Rows and Columns

In [6]:
df = pd.DataFrame({"Roll_No": [101, 102, 103,104],
                   "Name": ["Abdullah", "Arifeen", "Awais","Qasim"],
                   "FName":["Afzal","Farooq","Abbas","Ahmed"] ,
                   "Class": [8, 7, 9,4] ,
                   "Section": ["A", "B", "A","B"],
                   "Hifaz":[True,False,False,True], 
                   "Age": [13, 11, 16,9],
                   "City": ["GRW", "SKT", "ISL","Hijaz"],
                   "Institute":["UI/UX School","Flutter School","Coding School","Python School"],
                   "Domain":["AI ","NLP","DL","ML"],
                   "Marks": ["Exellent", "Normal", "Good","Best"],
                   "Grade": [90, 85, 95,80],
                   "Salary":[50000, 40000, 35000,45000]

                   })
df

,Roll_No,Name,FName,Class,Section,Hifaz,Age,City,Institute,Domain,Marks,Grade,Salary
0,101,Abdullah,Afzal,8,A,True,13,GRW,UI/UX School,AI,Exellent,90,50000
1,102,Arifeen,Farooq,7,B,False,11,SKT,Flutter School,NLP,Normal,85,40000
2,103,Awais,Abbas,9,A,False,16,ISL,Coding School,DL,Good,95,35000
3,104,Qasim,Ahmed,4,B,True,9,Hijaz,Python School,ML,Best,80,45000

In [ ]:
df[['Name','FName']] # select two columns from dataframe

In [ ]:
df.describe()

## 1st method to select rows with loc function

In [ ]:
df.describe().loc[['min','25%','50%','75%','max']]

## 2nd method to select rows with loc function

In [ ]:
df.describe().loc['min':'max']

## To print all columns with loc function

In [ ]:
df.describe().loc['min':'max',:]

## To print specific columns with loc function

In [ ]:
# df.describe().loc['mean':'max',['Salary','Class']] # 1st method

df.describe().loc['mean':'max','Class':'Salary']

# 19 Reshape Multi-Index Series

In [7]:
df.groupby('Name').Salary.mean()

Name
Abdullah    50000.0
Arifeen     40000.0
Awais       35000.0
Qasim       45000.0
Name: Salary, dtype: float64

In [ ]:
df.groupby(['Section','Domain']).Salary.mean()
# pd.cut( df.Age, bins=[0,7,10], labels=['baby','child','boy']).head()

# 20 Continuous to Catogorical Data Conversion

### new column is created after changing column <class/> data to catogorical value

In [ ]:
df['State'] = pd.cut(df.Class , bins = [ 0,5,8] , labels = ['baby','child'])
df

# 21. Convert One Set Values to Other

In [ ]:
df.Section.map({'A':12,'B':13}) # Changing Value of A and B to 12 and 13

### Factorize()[0] is used for encoding (feature enginneering) to assign different numerical (0-1) values to the catogorical data

In [ ]:
ddf = sns.load_dataset("titanic")
ddf['embarked_num'] = ddf.embarked.factorize()[0]
ddf

# 22- Transpose a Wide DataFrame

In [ ]:
from random import random
import numpy as np
import pandas as pd
df = pd.DataFrame(np.random.rand(200,25) , columns=list('abcdefghijklmnopqrstuvwxy'))
df
df.head(10).T

In [ ]:
df.describe().T

# 23- Reshaping a DataFrame

In [ ]:
distance = pd.DataFrame([['12345',100,200,300],['34567',400,500,600],['67890',700,800,900]] , 
                        columns= ['zip','factory','warehouse','retail'])
distance

In [ ]:
distance2 = pd.DataFrame([[1,'12345','factory'],[2,'34567','warehouse']] , 
                         columns= ['user-id','zip','location-type'])
distance2

In [9]:
distancelong = distance.melt(id_vars='zip',var_name='location_type',value_name='distance')
distancelong

     zip location_type  distance
0  12345       factory       100
1  34567       factory       400
2  67890       factory       700
3  12345     warehouse       200
4  34567     warehouse       500
5  67890     warehouse       800
6  12345        retail       300
7  34567        retail       600
8  67890        retail       900

In [ ]:
sns.barplot(x='zip',y='distance',hue='location_type',data=distancelong)